In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\yaswant_sadasivuni\pycharmprojects\pythonproject1\.venv\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\yaswant_sadasivuni\pycharmprojects\pythonproject1\.venv\lib\site-packages (from pandas) (2.2.5)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\yaswant_sadasivuni\pycharmprojects\pythonproject1\.venv\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\yaswant_sadasivuni\pycharmprojects\pythonproject1\.venv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\yaswant_sadasivuni\pycharmprojects\pythonproject1\.venv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\yaswant_sadasivuni\pycharmprojects\pythonproject1\.venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [2]:
import pandas as pd

In [4]:
## Series
data = [1,2,3,4,5]
series = pd.Series(data)
print(series)
print(type(series))

0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [5]:
## Create a series from dictionary
data = {'a':1,'b':2,'c':3}
series = pd.Series(data)
print(series)

a    1
b    2
c    3
dtype: int64

In [7]:
data=[10,20,30]
index=['a','b','c']
pd.Series(data, index=index)

a    10
b    20
c    30
dtype: int64

In [8]:
## Dataframe
## create a dataframe from a dictionary of list

data={
    'Name': ['Yaswant', 'jhon', 'jack'],
    'Age': [35,25,40],
    'City': ['Newyork', 'Banglore', 'Florida']
}
df = pd.DataFrame(data)
print(df)

      Name  Age      City
0  Yaswant   35   Newyork
1     jhon   25  Banglore
2     jack   40   Florida

In [9]:
import numpy as np
np.array(df)

array([['Yaswant', 35, 'Newyork'],
       ['jhon', 25, 'Banglore'],
       ['jack', 40, 'Florida']], dtype=object)

In [10]:
## create a dataframe from a list of dictionaries
data=[
    {'Name': 'yaswant', 'Age': 35, 'City': 'New York'},
    { 'Name': 'jhon', 'Age': 25, 'City': 'Florida'},
    { 'Name': 'jack', 'Age': 40, 'City': 'Banglore'}
]
df = pd.DataFrame(data)
print(df)

      Name  Age      City
0  yaswant   35  New York
1     jhon   25   Florida
2     jack   40  Banglore

In [11]:
df['Name']

0    yaswant
1       jhon
2       jack
Name: Name, dtype: object

In [12]:
df.loc[0]

Name     yaswant
Age           35
City    New York
Name: 0, dtype: object

In [15]:
df.iloc[0]

Name     yaswant
Age           35
City    New York
Name: 0, dtype: object

In [21]:
df.at[0, 'Name']

'yaswant'

In [22]:
## Accessing specified element using iat
df.iat[2,2]

'Banglore'

In [23]:
## Data Manipulations with Dataframes
df

      Name  Age      City
0  yaswant   35  New York
1     jhon   25   Florida
2     jack   40  Banglore

In [24]:
df['Salary'] = [70000, 35000, 40000]

In [25]:
df

      Name  Age      City  Salary
0  yaswant   35  New York   70000
1     jhon   25   Florida   35000
2     jack   40  Banglore   40000

In [26]:
## remove a column
df.drop('Salary', axis=1, inplace=True)

In [27]:
df

      Name  Age      City
0  yaswant   35  New York
1     jhon   25   Florida
2     jack   40  Banglore

In [28]:
df['Age'] = df['Age'] + 1
df

      Name  Age      City
0  yaswant   36  New York
1     jhon   26   Florida
2     jack   41  Banglore